Revit 2027 API
Alignment.GetAlignments Method
Overload List
Name | Description
GetAlignments(Document) |  Returns all alignments in the given document.
GetAlignments(View) |  Returns all alignments visible in the given view.
Top
See Also
Reference
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace